# coding:utf-8
import json

user_addresses = [(1, '测试曹', '15861247225', 1, 2, 3)]

china_areas = [(1, 0, '中国'), (2, 1, '北京'), (3, 1, '安徽'), (4, 1, '福建'), (5, 1, '甘肃'), (6, 1, '广东'), (7, 1, '广西'), (8, 1, '贵州'), (9, 1, '海南'), (10, 1, '河北'), (11, 1, '河南'), (12, 1, '黑龙江'), (13, 1, '湖北'), (14, 1, '湖南'), (15, 1, '吉林'), (16, 1, '江苏'), (17, 1, '江西'), (18, 1, '辽宁'), (19, 1, '内蒙古'), (20, 1, '宁夏'), (21, 1, '青海'), (22, 1, '山东'), (23, 1, '山西'), (24, 1, '陕西'), (25, 1, '上海'), (26, 1, '四川'), (27, 1, '天津'), (28, 1, '西藏'), (29, 1, '新疆'), (30, 1, '云南'), (31, 1, '浙江'), (32, 1, '重庆'), (33, 1, '香港'), (34, 1, '澳门'), (35, 1, '台湾'), (36, 3, '安庆'), (37, 3, '蚌埠'), (38, 3, '巢湖'), (39, 3, '池州'), (40, 3, '滁州'), (41, 3, '阜阳'), (42, 3, '淮北'), (43, 3, '淮南'), (44, 3, '黄山'), (45, 3, '六安'), (46, 3, '马鞍山'), (47, 3, '宿州'), (48, 3, '铜陵'), (49, 3, '芜湖'), (50, 3, '宣城'), (51, 3, '亳州'), (52, 2, '北京'), (53, 4, '福州'), (54, 4, '龙岩'), (55, 4, '南平'), (56, 4, '宁德'), (57, 4, '莆田'), (58, 4, '泉州'), (59, 4, '三明'), (60, 4, '厦门'), (61, 4, '漳州'), (62, 5, '兰州'), (63, 5, '白银'), (64, 5, '定西'), (65, 5, '甘南'), (66, 5, '嘉峪关'), (67, 5, '金昌'), (68, 5, '酒泉'), (69, 5, '临夏'), (70, 5, '陇南'), (71, 5, '平凉'), (72, 5, '庆阳'), (73, 5, '天水'), (74, 5, '武威'), (75, 5, '张掖'), (76, 6, '广州'), (77, 6, '深圳'), (78, 6, '潮州'), (79, 6, '东莞'), (80, 6, '佛山'), (81, 6, '河源'), (82, 6, '惠州'), (83, 6, '江门'), (84, 6, '揭阳'), (85, 6, '茂名'), (86, 6, '梅州'), (87, 6, '清远'), (88, 6, '汕头'), (89, 6, '汕尾'), (90, 6, '韶关'), (91, 6, '阳江'), (92, 6, '云浮'), (93, 6, '湛江'), (94, 6, '肇庆'), (95, 6, '中山'), (96, 6, '珠海'), (97, 7, '南宁'), (98, 7, '桂林'), (99, 7, '百色'), (100, 7, '北海')]



user_address_list = []
for user_address in user_addresses:
    result= {}
    print(user_address)
    result['id']=user_address[0]
    result['consignee']=user_address[1]
    result['mobile']=user_address[2]

    for china_area in china_areas:
        if user_address[3] == china_area[0]:
            result['prince']=china_area[2]

        if user_address[4] == china_area[0]:
            result['city']=china_area[2]
        if user_address[5] == china_area[0]:
            result['areas']=china_area[2]
    user_address_list.append(result)
print(user_address_list)
